#+title: How To Convert An Array Of Hashes Into A Hash in Ruby
#+abstract: How To Convert an Array of Hashes to a Hash in Ruby
#+tags: Ruby
#+tags: ClojureScript

* How To Convert An Array Of Hashes Into A Hash in Ruby

To convert:

#+begin_src ruby
arr = [{a: 1}, {b: 2}, {c: 3}]
#+end_src

into:

#+begin_src ruby
h = { a: 1, b: 2, c: 3 }
#+end_src

** Method 1: Use the ~reduce~ method

Use the ~reduce~ method along with the ~merge~ method:

#+begin_src ruby
arr = [{a: 1}, {b: 2}, {c: 3}]
arr.reduce({}, :merge)
#+end_src

#+RESULTS:
| :a=>1 | :b=>2 | :c=>3 |

** Method 2: Use the ~inject~ method


Use the ~inject~ method along with the ~merge~ method:

#+begin_src ruby
arr = [{a: 1}, {b: 2}, {c: 3}]
arr.inject(:merge)
#+end_src

#+RESULTS:
| :a=>1 | :b=>2 | :c=>3 |

~Hash#merge~ creates a new hash on each iteration. For bigger arrays, it is more
performant to use ~Hash#merge!~/~Hash#update~.
